app/controllers/carts_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
  def index
    @cart = Cart.find_by(user_id: current_user.id)

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 2], ["created_at", "2023-06-01 16:19:14.224905"], ["updated_at", "2023-06-01 16:19:14.224905"]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
INSERT INTO "cart_products" ("cart_id", "product_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cart_id", 1], ["product_id", 2], ["quantity", nil], ["created_at", "2023-06-01 15:42:44.684297"], ["updated_at", "2023-06-01 15:42:44.684297"]]
UPDATE "products" SET "stock" = COALESCE("stock", 0) - ? WHERE "products"."id" = ?  [["stock", 1], ["id", 4]]
---
  def add_to_cart
    product = Product.find(params[:product_id])
    if product.stock > 0
      @cart = Cart.find_or_create_by(user_id: current_user.id)
      # product.update(cart: @cart)
      @cart.products << product
      product.decrement!(:stock)

INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 1], ["created_at", "2023-06-01 11:31:45.656322"], ["updated_at", "2023-06-01 11:31:45.656322"]]
---
  def create
    @cart = Cart.new(cart_params)

    respond_to do |format|
      if @cart.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
DELETE FROM "cart_products" WHERE "cart_products"."cart_id" = ? AND "cart_products"."product_id" = ?  [["cart_id", 1], ["product_id", 2]]
UPDATE "products" SET "cart_id" = ? WHERE "products"."cart_id" = ? AND "products"."id" = ?  [["cart_id", nil], ["cart_id", 1], ["id", 12]]
---
  def remove_from_cart
    product = Product.find(params[:product_id])
    if product.stock > 0
      @cart = Cart.find_by(user_id: current_user.id)
      @cart.products.delete(product)
      product.increment!(:stock)

SELECT "cart_products".* FROM "cart_products" WHERE "cart_products"."cart_id" = ? AND "cart_products"."product_id" = ? LIMIT ?  [["cart_id", 1], ["product_id", 2], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
UPDATE "products" SET "stock" = COALESCE("stock", 0) - ? WHERE "products"."id" = ?  [["stock", 1], ["id", 2]]
UPDATE "cart_products" SET "quantity" = COALESCE("quantity", 0) + ? WHERE "cart_products"."id" = ?  [["quantity", 1], ["id", 1]]
---
  def increase_quantity
    product = Product.find(params[:product_id])
    if product.stock > 0
      @cart = Cart.find_by(user_id: current_user.id)
      cart_product = @cart.cart_products.find_by(product_id: product.id)
      cart_product.increment!(:quantity)
      product.decrement!(:stock)

SELECT "cart_products".* FROM "cart_products" WHERE "cart_products"."cart_id" = ? AND "cart_products"."product_id" = ? LIMIT ?  [["cart_id", 1], ["product_id", 4], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
UPDATE "products" SET "stock" = COALESCE("stock", 0) + ? WHERE "products"."id" = ?  [["stock", 1], ["id", 4]]
UPDATE "cart_products" SET "quantity" = COALESCE("quantity", 0) - ? WHERE "cart_products"."id" = ?  [["quantity", 1], ["id", 2]]
UPDATE "products" SET "stock" = COALESCE("stock", 0) + ? WHERE "products"."id" = ?  [["stock", 1], ["id", 1]]
DELETE FROM "cart_products" WHERE "cart_products"."id" = ?  [["id", 3]]
---
  def decrease_quantity
    product = Product.find(params[:product_id])
    @cart = Cart.find_by(user_id: current_user.id)
    cart_product = @cart.cart_products.find_by(product_id: product.id)
    if cart_product.quantity && cart_product.quantity > 1
      cart_product.decrement!(:quantity)
      product.increment!(:stock)
      redirect_to carts_path, notice: t("views.cart.quantity_decreased")
    else
      cart_product.destroy
      product.increment!(:stock)

SELECT "cart_products".* FROM "cart_products" WHERE "cart_products"."cart_id" = ? AND "cart_products"."product_id" = ? LIMIT ?  [["cart_id", 1], ["product_id", 1], ["LIMIT", 1]]
---
  def calculate_total_price(products)
    total_price = 0
    products.each do |product|
      cart_product = CartProduct.find_by(cart: @cart, product: product)